[{
	  "company": "AL ELM Information Security Company",
	  "role": "Senior Software Engineer/Lead => Solutions Architect",
	  "date": "Nov 2013 – Present",
	  "location": "Riyadh, Saudi Arabia",
	  "description_bullets": [
		  "Elm Company is a Saudi Joint Stock Company owned by Saudi Public Investment Fund (PIF), it is specialized in providing secure electronic services, and has been in existence since 1988 as a technical research and development lab for the Saudi Ministry of Interior",
		  "Implementing government services while practicing agile methodology to achieve high velocity in delivery in multiple Projects over the past 6+ years.",
		  "<b>Architecture and Presales Team (October 2019)</b>: <br /> Working on the Technical presales team to design, document, architect, and price software solutions as a response to RFPs.",
		  "<b>Muqeem (muqeem.sa)/Premium Residency (saprc.gov.sa) </b>: <br /> A portal to allow companies to managing activities for its Residents in saudi arabia with cooperation with Jawazat (General Directorate of Passports).<br /> We are building the next generation of Muqeem using Java, Spring Boot, Netflix SSO (eureka, zuul, hystrix, Ribbon etc… ), spring-amqp, RabbitMQ, Redis, Docker, Microservice architecture and wiremock/Castle Mock. <br />Using: Java 8, Kotlin, Spring Boot (Using JHipster microservice), JWT, Quartiz, JPA, RabbitMQ, Redis, SQL Server, Unit & Integration testing, Docker and using atlassian stack.",
		  "<b>Marine</b>: <br /> A portal for Public Transport Authority (PTA), it is used to give permission and register activities related to the Marine section in PTA, My role mainly to integrate with Companies Billing System and PTA billing System.<br />Using: Java 8, Spring Boot (with Spring Data JPA, Security, REST), Hibernate, SQL Server, Apache Tomcat 8 in the backend to expose the app as a secured API, Angular 4 in the frontend and IBM RTC for software-related aspects.",
		  "<b>Mojaz (https://mojaz.com.sa)</b>:<br />A Portal that allows public users to query about car history (including accident history) and print a full report about it, My role mainly to integrate with Companies Billing System and PTA billing System.<br /> Using: Java 8, Spring Boot (Spring Data JPA, Security, REST), Hibernate, SQL Server, Apache Tomcat 8 in the backend to expose the app as a secure API, AngularJS 1.x in the frontend and IBM RTC for software-related aspects.",
		  "<b>ETV (https://etv.com.sa)</b>: <br /> A portal for Saudi Commission for Tourism & National Heritage (SCTH), that allows Umrah visa holder to do tourism activities after finishing the Umrah program by changing the sponsor. (many integrations with NIC, Sejel is being included)<br /> Using: Java 8, Spring framework (Security, Data JPA, REST), Hibernate, SQL Server, Apache Tomcat 8 in the backend to expose the app as a secure API, AngularJS in the frontend, Rational Team Concert for SCM and OpenShift (as a PoC); in a team of 3 Developers.",
		  "<b>Basher (https://basher.sa)</b>: <br /> Bashir is a compound project, consists of a mobile app that connects to REST service and a Portal to manage users, reports, statistics and other aspects.<br /> Using: Spring framework, (Core, Security, Data JPA), Hibernate, PrimeFaces 5.1 (JSF 2.2), Apache Tomcat 8, JBOSS 7.1 and MS SQL Server.<br /> I worked as the developer responsible for the project working with 1 Senior developer and 2 Junior Developers, working directly with SA, BA, QA and PM.",
		  "<b>TAMM (https://www1.tamm.net.sa/)</b>: <br /> TAMM is the project and group of services used by multiple user roles (Car Agencies, Show rooms, etc.) to connect theses users with the Saudi Arabia NIC, I am working on adding new features and maintaining the old features.<br /> Using: JSF 1.2/EJB 3.1, CDI, SOAP and REST services, JWT, JBOSS EAP 6.1 and MS SQL Server."
	  ]
	},
	{
	  "company": "SiliconExpert Technologies - an Arrow Electronics Company",
	  "role": "Senior Software Engineer => Team Leader",
	  "date": "Nov 2010 – Nov 2013",
	  "location": "Cairo, Egypt",
	  "description_bullets": [
		  "Headquartered in Santa Clara, is a leading supplier and innovator of best-in-class products and services for enterprise-wide electronic parts management. Customers are: Avago, Exar, Avnet, Arrow, RS, NASA, Dell, Rockwell, and Toshiba.",
		  "I am working directory with our BA to analyze customer requirements and find rapid solutions for customers continuously requests.",
		  "Develop solutions using EJB3.0, JPA, Servlets, JSPs, Custom tags, Filters, XML, JAX-WS, Apache Axis, GWT, JSON, JAX-WS, JavaScript, Apache Lucene, Apache Solr, Android SDK, iOS, Oracle DB, Oracle App Server, tomcat, Spring-jms, git-scm, intellij idea, Eclipse, JIRA, Jenkins and YouTrack",
		  "<b>Build JMS Client to consume logs</b>: <br />Use Spring JMS to write a log listener to write logs of one of our services into Apache Flume",
		  "<b>Modifying Spark (XMPP client)</b>:<br />Spark is an Open Source, cross-platform Jabber (XMPP) client optimized for businesses and organizations. I was responsible for modifying the app and deliver a windows installation package using install4j/IzPack.",
		  "<b>Arrow Mobile App</b>:<br />Arrow inc. www.arrow.com is the company that acquired SiliconExpert.<br />I am acting as a project leader to provide Arrow inc with iOS and Android Mobile Apps.<br />We are building native mobile apps and building a JSON aggregator Service to call existing modules and provide the functionality for the mobile apps.<br />[https://itunes.apple.com/us/app/arrow-electronics/id792340251] [https://play.google.com/store/apps/details?id=com.arrow.android]",
		  "<b>SiliconExpert Mobile App</b>: <br /> Building the Company’s iPhone/Android Mobile Application front end and build a JSON Service backed by an EJB module connecting to Oracle DB. <br /> [https://itunes.apple.com/us/app/siliconexpert-part-search/id633913855?ls=1&mt=8]",
		  "<b>Avago PartFinder Project</b>: <br /> Integration of some of our services into customer's website through a Widget that is hosted on our domain and deployed into the customer's Web App. The work includes running cross-site JavaScript (Same-origin policy) and many other challenges to make it work on Almost all browsers starting from IE6.0. <br />  [http://partfinder.avagotech.com/Avago/AvagoWidget.html]",
		  "<b>Avago PartFinder Mobile (iPhone/Android)</b>: <br /> Converting Avago Application into a Mobile Application(Android and iOS). The work included converts the Business layer into JSON Services using a custom home-build framework and then consume the JSON services using Mobile Apps. <br /> [http://itunes.apple.com/us/app/avago-partfinder/id478409707?mt=8] [https://market.android.com/details?id=com.avago.android]",
		  "<b>Exar Project</b>: <br /> ntegration of some of our services into customer's website. [http://app.siliconexpert.com/Exar]",
		  "<b>MainSearch</b>: <br /> A Lucene Manager tool; a tool with a Web-based interface to allow users to search/create/edit/delete indexes. [http://demo.siliconexpert.com/MainSearch/]",
		  "<b>Design Center</b>: <br /> Web Application for Electronic Engineers to search for reference designs and other staff they need in designing Electronic Circuits. <br />The work includes investigating on the issue of Search engine optimization (SEO) and crawling for Ajax Applications.",
		  "Worked on securing companies web services (using HTTPS) and writing clients to consume these web services"
	  ]
	},
	{
	  "company": "CyberSource a VISA Company",
	  "role": "Software Engineer",
	  "date": "April 2009 – Nov 2010",
	  "location": "Cairo, Egypt",
	  "description_bullets": [
		 "Headquartered in Mountain View, California, is a leading provider of electronic payment and risk management services",
	    "Responsible for Design and implement ePayment Solutions",
		 "Worked with payment services like, Auth, Bill, Credit, Refund, many of PayPal Services and others",
		 "Develop solutions using Java, C, Servlets, XML, XSLT, XPath, JPos, JBoss, Linux, Rational ClearCase and AccuRev",
		 "Fixed Major encoding issue in China PayEase gateway simulator",
		 "Worked on many PayPal bug fixes. (PayPal EC and Button create service)",
		 "Worked on bug fixes for other Payment gateways as well including Paymentech and APACS30 gateways"
	  ]
	},
	{
  "company": "ElRowad",
  "role": "Software Engineer",
  "date": "Jan 2009 – April 2009",
  "location": "Cairo, Egypt",
  "description_bullets": [
    "Responsible for the Design and Implementation of company's own Stock Management software"
  ]
}]
