[
  "Good understanding of type theory and the programming paradigm",
  "Good knowledge about JVM echo system (Kotlin, Groovy, Scala)",
  "Good understand parallelism and consurrency and replated patterns (e.g. CSP) and its implementations in golang and kotlin",
  "Basic knowledge Linux programming (syscalls, strace, LKM, LSM, filesystems, namespaces and others)",
  "Basic understanding of the different storage types (object, block, file) and its use cases",
  "Basic understanding Hypervisors and containerization (the theory and practices)",
  "Experience with full-Stack Web Development (Angular, Vue.js, Mustache.js and others)",
  "Object-Oriented Analysis, Design, Programming (OOA/OOD/OOP)",
  "Algorithm Design and Analysis",
  "Behavior / Test Driven Development - Unit, Integration, System Testing",
  "Agile Methodologies - Scrum, Kanban",
  "Experience in RDBMS and ORM - Oracle, SQL Server, MySQL, PostgreSQL",
  "Experience in NoSQL - MongoDB, Cloudant",
  "Good knowldge about in Linux Configuration &amp; shell scripting",
  "Java (Threading, Networking, JDBC, RMI, JPA)",
  "C, Objective-c and UNIX C programming.",
  "Web (JSP&Servlets, Struts, JSF, Freemarker, MVC, Front-Controller, etc).",
  "Distributed Programming (App Servers, EJB and JNDI) and messaging (RabbitMQ, JMS, Apache Camel).",
  "A good background in Web Services (SOAP-based and RESTful) and XML (SAX, DOM, XSLT, XPath)",
  "Spring framework, Spring Security, Spring Data (JPA, Mongo) and Spring AMQP.",
  "Hibernate, Struts1.x and Tiles.",
  "Mobile Programming (Android /iPhone)",
  "Searching solutions (Apache Lucene/Solr)",
  "Background knowledge in other languages as well (C#, VB.net, C++, PL-SQL)",
  "Mongodb (implemented mongodb as a contribution to Castle Mock)",
  "Basic understanding of ISO 8601, Unicode and other related standards.",
  "Basic understanding of OSI model and related protocols (TCP, UDP, DNS, ARP, FTP, SSH, TLS), and basic knowledge about networking tools like iptables, iproute2, wireshark, tcpdump, and more.",
  "Good understanding of digital cryptography.",
  "Good understanding of ESB, EAI, Queues, BPM, and related enterprise solutions and patterns",
  "Hands-on experience in Jenkins, bitbucket pipelines, Docker, Docker Compose, Kubernetes, GCP and AWS."
]
